DataProcessors/ИА_БПМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИА_БПМенеджер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ИА_БПНоситель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерЗадач</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПКартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИА_Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_Календарь</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рабочий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_БПТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПТипыТочекМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйБизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПСостояниеТочекМаршрутаНаКарте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПСостояниеТочекМаршрутаНаКарте</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСоздана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполненаУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненаУведомление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПДействияНадЗадачами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПДействияНадЗадачами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоздатьНевыполненной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписатьВыполненной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключитьИзОбработки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПСобытияТочекБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПСобытияТочекБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Условие_ПроверкаУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие_ПриВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеНаименования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСодержания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаОтветственного</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПВариантыДней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПВариантыДней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПСпособыЗаполненияДопРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПСпособыЗаполненияДопРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Установить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенести</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПТипыАдресацииЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПТипыАдресацииЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_БПКартыМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПКартыМаршрутов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИА_БПМенеджер/Ext/ObjectModule.bsl
Перем ТаблицаТочек;
Перем СписокТиповДляЗадач;
Перем РежимНовойКарты;
Перем ОбъектБизнесПроцесс;
//_____________________________________________________________
// ИНТЕРФЕЙС

Процедура Инициализировать(БП, КартаМаршрутаНовая = Неопределено, БизнесПроцессОбъект = Неопределено) Экспорт
    БизнесПроцесс = БП;
    Если КартаМаршрутаНовая = Неопределено Тогда
        КартаМаршрута      = БизнесПроцесс.ИА_КартаМаршрутаБП;
        РежимНовойКарты    = Ложь;
    Иначе
        КартаМаршрута      = КартаМаршрутаНовая;
        РежимНовойКарты    = Истина;
    КонецЕсли; 
    
    ОбъектБизнесПроцесс = БизнесПроцессОбъект;
    
    МенеджерЗадач = Задачи[БизнесПроцесс.Метаданные().Задача.Имя];
    ЗадачаИмя = МенеджерЗадач.ПустаяСсылка().Метаданные().Имя;
    
    менТипы = Перечисления.ИА_БПТипыТочекМаршрута;
    СписокТиповДляЗадач = Новый Массив;
    СписокТиповДляЗадач.Добавить(менТипы.Действие);
    СписокТиповДляЗадач.Добавить(менТипы.Условие);
    СписокТиповДляЗадач.Добавить(менТипы.ВложенныйБизнесПроцесс);
    
    Точки_ПолучитьКэш();
КонецПроцедуры

Функция   ПолучитьЗадачиВсе() Экспорт
    ТЗ = Задачи_ПолучитьИнформацию();
    Результат = ТЗ.ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции

Функция   ПолучитьЗадачиНевыполненные() Экспорт
    ТЗ = Задачи_ПолучитьИнформацию();
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТЗ, "СтрокаТЗ.Выполнена");
    Результат = ТЗ.ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции

Функция   ПолучитьЗадачиВыполненные() Экспорт
    ТЗ = Задачи_ПолучитьИнформацию();
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТЗ, "НЕ СтрокаТЗ.Выполнена");
    Результат = ТЗ.ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции

Функция   ПолучитьКартуМаршрута() Экспорт
    Карта = Справочники.ИА_БПКартыМаршрутов.ПолучитьКартуМаршрута(КартаМаршрута);    
    Если Карта = Неопределено Тогда
        Возврат Новый ГрафическаяСхема;
    КонецЕсли; 
    ТабЗадачи = Задачи_ПолучитьИнформацию();
    Состояния = Перечисления.ИА_БПСостояниеТочекМаршрутаНаКарте;
    
    Для каждого Эл Из Карта.ЭлементыГрафическойСхемы Цикл
        КраситьВыполненые = Истина;
        Если ТипЗнч(Эл) = Тип("ЭлементГрафическойСхемыУсловие") Тогда
            КраситьВыполненые = Ложь;
        КонецЕсли; 
        М = ТабЗадачи.НайтиСтроки(Новый Структура("ИмяТочкиБП", Эл.Имя));
        ЕстьВыполненные = Ложь;
        ЕстьНеВыполненные = Ложь;
        Для каждого СтрокаТЗ Из М Цикл
            ТочкаИнфо = Точки_ПолучитьИнформацию(СтрокаТЗ.ИА_ТочкаБП);
            
            Если СтрокаТЗ.Выполнена Тогда
                ЕстьВыполненные = Истина
            ИначеЕсли Не СтрокаТЗ.Выполнена Тогда
                ЕстьНеВыполненные = Истина
            КонецЕсли; 
        КонецЦикла;
        
        Если ЕстьНеВыполненные Тогда
            ГрафСхема_Отметить(Эл, ?(ТочкаИнфо.ЭтоУведомление, Состояния.НеВыполненаУведомление, Состояния.НеВыполнена));
        ИначеЕсли ЕстьВыполненные и КраситьВыполненые Тогда
            ГрафСхема_Отметить(Эл, ?(ТочкаИнфо.ЭтоУведомление, Состояния.ВыполненаУведомление, Состояния.Выполнена));
        КонецЕсли; 
    КонецЦикла; 
    
    Возврат Карта;
КонецФункции

//_____________________________________________________________

Процедура ГрафСхема_Отметить(Элемент, Состояние, КартаПустая = Неопределено) Экспорт
    Состояния = Перечисления.ИА_БПСостояниеТочекМаршрутаНаКарте;
    
    ЭлементДоИзменений = ?(КартаПустая = Неопределено, Элемент, КартаПустая.ЭлементыГрафическойСхемы.Найти(Элемент.Имя));
    
    ЗаполнитьЗначенияСвойств(Элемент, ЭлементДоИзменений, "ЦветФона, ЦветРамки");
    
    Если Состояние = Состояния.НеСоздана Тогда
        // Ничего !
    ИначеЕсли Состояние = Состояния.НеВыполнена Тогда
        Элемент.ЦветРамки = WebЦвета.Красный;
    ИначеЕсли Состояние = Состояния.Выполнена Тогда
        Элемент.ЦветФона  = WebЦвета.ЗеленаяЛужайка;
        
    ИначеЕсли Состояние = Состояния.ВыполненаУведомление Тогда
        Элемент.ЦветФона  = WebЦвета.ЛимонноЗеленый;
    ИначеЕсли Состояние = Состояния.НеВыполненаУведомление Тогда
        Элемент.ЦветРамки = WebЦвета.СинийСоСтальнымОттенком;
    КонецЕсли; 
КонецПроцедуры


//_____________________________________________________________
// Работа с БП

Процедура БП_Старт(Отказ) Экспорт
    Если БизнесПроцесс.Стартован Тогда
        ВызватьИсключение "Уже стартован " + БизнесПроцесс + " !";
    КонецЕсли;
    
    ТабОбязательныхРеквизитов = ИА_БФС.Запрос_ВыполнитьВТЗ(
    "ВЫБРАТЬ разрешенные
    |   ИА_БПНосительИА_Реквизиты.Реквизит,
    |   ИА_БПНосительИА_Реквизиты.Значение
    |ПОМЕСТИТЬ Таб
    |ИЗ
    |   БизнесПроцесс.ИА_БПНоситель.ИА_Реквизиты КАК ИА_БПНосительИА_Реквизиты
    |ГДЕ
    |   ИА_БПНосительИА_Реквизиты.Реквизит.Обязательный
    |   И ИА_БПНосительИА_Реквизиты.Ссылка = &Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ  разрешенные
    |   ИА_БПРеквизиты.Ссылка КАК Реквизит
    |ПОМЕСТИТЬ РеквизитыИзКарты
    |ИЗ
    |   ПланВидовХарактеристик.ИА_БПРеквизиты КАК ИА_БПРеквизиты
    |ГДЕ
    |   ИА_БПРеквизиты.ВладелецРеквизита = &МаршрутЗадач
    |   И ИА_БПРеквизиты.Обязательный
    |   И НЕ ИА_БПРеквизиты.ЭтоГруппа
    |   И НЕ ИА_БПРеквизиты.Ссылка В
    |               (ВЫБРАТЬ
    |                   Таб.Реквизит
    |               ИЗ
    |                   Таб КАК Таб)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   Таб.Реквизит,
    |   Таб.Значение
    |ИЗ
    |   Таб КАК Таб
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   РеквизитыИзКарты.Реквизит,
    |   0
    |ИЗ
    |   РеквизитыИзКарты КАК РеквизитыИзКарты"
    , Новый Структура("Ссылка, МаршрутЗадач", БизнесПроцесс, БизнесПроцесс.ИА_МаршрутЗадачБП));
    
    ТекстСообщения = "";
    Для каждого Стр Из ТабОбязательныхРеквизитов Цикл
        Стр.Значение = Стр.Реквизит.ТипЗначения.ПривестиЗначение(Стр.Значение); // 2015/10/13
    	Если НЕ ЗначениеЗаполнено(Стр.Значение) Тогда
        	ТекстСообщения = ТекстСообщения + Символы.ПС + " — не заполнен """ + Стр.Реквизит+ """ !";
        КонецЕсли; 
    КонецЦикла; 
    
    Если ЗначениеЗаполнено(ТекстСообщения) Тогда
    	ТекстСообщения = "Невозможно стартовать бизнес-процесс, т.к. есть незаполненные реквизиты: " + ТекстСообщения;
        ИА_БФКС.СообщениеОбОшибке(ТекстСообщения, Отказ); 
        Возврат;
    КонецЕсли; 
    
    ТочкаСтарта = Справочники.ИА_БПКартыМаршрутов.ПолучитьТочкуСтарта(КартаМаршрута);
    М = Справочники.ИА_БПТочкиМаршрута.ПолучитьИсходящиеТочки(ТочкаСтарта);
    
    Для каждого Точка Из М Цикл
        Задачи_СоздатьПоТочке(Точка);	
    КонецЦикла; 
КонецПроцедуры

Функция   БП_ПолучитьДействияДляПерехода(СписокТочек, КартаМаршрутаНовая = Неопределено) Экспорт
    СписокТочек = ИА_БФКС.Массив_ПолучитьУникальныеЭлементы(СписокТочек);
    Если КартаМаршрутаНовая = Неопределено Тогда
        КартаМаршрутаНовая = КартаМаршрута;
    КонецЕсли;
    
    МассивТочекЗавершение = ИА_БФКС.Массив_ФильтрПоУсловию(СписокТочек
    , "Эл.Тип = Контекст", Перечисления.ИА_БПТипыТочекМаршрута.Завершение);
    РежимЗавершения = МассивТочекЗавершение.Количество() > 0;
    
    ПереходНаНовуюКарту = КартаМаршрута <> КартаМаршрутаНовая;
    
    ОбрБП = Обработки.ИА_БПМенеджер.Создать();
    ОбрБП.Инициализировать(ЭтотОбъект.БизнесПроцесс, КартаМаршрутаНовая);
    
    ТабВыполняемыеДействия  = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Точка, Задача, Действие");
    ТабРекомендации         = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Рекомендация, Точка1, Точка2");
    
    Действия = Перечисления.ИА_БПДействияНадЗадачами;
    
    ТабЗадачиТекущие = Задачи_ПолучитьИнформацию(, Истина);
    ТабЗадачиТекущие.Колонки.Ссылка.Имя     = "Задача";
    ТабЗадачиТекущие.Колонки.ИА_ТочкаБП.Имя = "Точка";
    
    Если РежимЗавершения Тогда
        НовСтрока = ТабВыполняемыеДействия.Добавить();
        НовСтрока.Точка= МассивТочекЗавершение[0];
        НовСтрока.Действие = Действия.ЗаписатьВыполненной;
        
        Для каждого СтрокаТЗ Из ТабЗадачиТекущие Цикл
            Если ЗначениеЗаполнено(СтрокаТЗ.Задача) И НЕ СтрокаТЗ.Выполнена Тогда
                НовСтрока = ТабВыполняемыеДействия.Добавить();
                ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
                НовСтрока.Действие = Действия.Удалить;
            КонецЕсли;
        КонецЦикла;
    ИначеЕсли ПереходНаНовуюКарту Тогда
        // Т.к. мы переходим на другую карту -> Завершить все задачи
        Для каждого СтрокаТЗ Из ТабЗадачиТекущие Цикл
            Если ЗначениеЗаполнено(СтрокаТЗ.Задача) И НЕ СтрокаТЗ.Выполнена Тогда
                НовСтрока = ТабВыполняемыеДействия.Добавить();
                ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
                НовСтрока.Действие = Действия.Удалить;
            КонецЕсли;
        КонецЦикла;
        // и создать новые
        Для каждого Точка Из СписокТочек Цикл
            НовСтрока = ТабВыполняемыеДействия.Добавить();
            НовСтрока.Точка = Точка;
            НовСтрока.Действие = Действия.СоздатьНевыполненной;
        КонецЦикла; 
    Иначе
        М = ТабЗадачиТекущие.НайтиСтроки(Новый Структура("Выполнена", Ложь));
        Для каждого СтрокаТЗ Из М Цикл
        	Если СписокТочек.Найти(СтрокаТЗ.Точка) = Неопределено Тогда
                НовСтрока = ТабВыполняемыеДействия.Добавить();
                ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
                НовСтрока.Действие = Действия.Удалить;
            КонецЕсли; 
        КонецЦикла; 
        
        Для каждого Точка Из СписокТочек Цикл
            // Пометим на удаление невыполненных "предков"
            Предки = Точки_НайтиВсехВозможныхПредков(Точка);
            ЗадачиПредкиНеВыполненные = ИА_БФС.ТЗ_ФильтрПоУсловию(ТабЗадачиТекущие
            , "ЗначениеЗаполнено(СтрокаТЗ.Задача) И Контекст.Найти(СтрокаТЗ.Точка) <> Неопределено И НЕ СтрокаТЗ.Выполнена"
            , Предки);
            Для каждого СтрокаТЗ Из ЗадачиПредкиНеВыполненные Цикл
                НовСтрока = ТабВыполняемыеДействия.Добавить();
                ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
                НовСтрока.Действие = Действия.ЗаписатьВыполненной;
            КонецЦикла; 
            
            М = ТабЗадачиТекущие.НайтиСтроки(Новый Структура("Точка", Точка));            
            
            //{ Проверим, что есть сейчас по этой точке
            ЕстьВыполненные = Ложь;
            ЕстьНеВыполненные = Ложь;
            Для каждого СтрокаЗадач Из М Цикл
                Если ЗначениеЗаполнено(СтрокаЗадач.Задача) Тогда
                    ЕстьВыполненные   = ЕстьВыполненные   ИЛИ    СтрокаЗадач.Выполнена;
                    ЕстьНеВыполненные = ЕстьНеВыполненные ИЛИ НЕ СтрокаЗадач.Выполнена;
                КонецЕсли;
            КонецЦикла;
            //}
            
            Если НЕ ЕстьНеВыполненные Тогда
                НовСтрока = ТабВыполняемыеДействия.Добавить();
                НовСтрока.Точка = Точка;
                НовСтрока.Действие = Действия.СоздатьНевыполненной;
            КонецЕсли;
            
            Если ЕстьВыполненные Тогда
                Для каждого СтрокаЗадач Из М Цикл
                    Если ЗначениеЗаполнено(СтрокаЗадач.Задача) И СтрокаЗадач.Выполнена Тогда
                        НовСтрока = ТабВыполняемыеДействия.Добавить();
                        НовСтрока.Точка = Точка;
                        НовСтрока.Задача = СтрокаЗадач.Задача;
                        НовСтрока.Действие = Действия.ИсключитьИзОбработки;
                	КонецЕсли;
                КонецЦикла; 
            КонецЕсли;
            
            Потомки = Точки_НайтиВсехВозможныхПотомков(Точка);
            Для каждого СтрокаТЗ Из ТабЗадачиТекущие Цикл
                Если ЗначениеЗаполнено(СтрокаТЗ.Задача) И Потомки.Найти(СтрокаТЗ.Точка) <> Неопределено Тогда
                    НовСтрока = ТабВыполняемыеДействия.Добавить();
                    ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
                    НовСтрока.Действие = Действия.Удалить;
                КонецЕсли; 
            КонецЦикла; 
        КонецЦикла;
    КонецЕсли;    
    ИА_БФС.ТЗ_УдалитьДубликаты(ТабВыполняемыеДействия, "Точка, Задача");
    
    Если НЕ РежимЗавершения Тогда
        // А теперь разрешим конфликты 
        // 1) "Двойной" поток
        // 2) Будущие задачи не м.б. выполнены, т.к. теперь не хватает "выполненных" задач
        
        МассивНовыхНеВыполненныхТочек      = Новый Массив;
        МассивНовыхБудущихВыполненныхТочек = Новый Массив; // Здесь д.б. все точки к-е когда-либо будут выполнены
        // получим "текущие"
        Для каждого СтрокаТЗ Из ТабЗадачиТекущие Цикл
            Если ЗначениеЗаполнено(СтрокаТЗ.Задача) И НЕ СтрокаТЗ.Выполнена Тогда
                ИА_БФКС.Массив_ДобавитьЕслиНет(МассивНовыхНеВыполненныхТочек, СтрокаТЗ.Точка);
                //ИА_БФКС.Массив_ДобавитьЕслиНет(МассивНовыхБудущихВыполненныхТочек, СтрокаТЗ.Точка);
            ИначеЕсли ЗначениеЗаполнено(СтрокаТЗ.Задача) И СтрокаТЗ.Выполнена Тогда
                ИА_БФКС.Массив_ДобавитьЕслиНет(МассивНовыхБудущихВыполненныхТочек, СтрокаТЗ.Точка);
            КонецЕсли; 
        КонецЦикла; 
        МассивНовыхНеВыполненныхТочек        = ИА_БФКС.Массив_ПолучитьУникальныеЭлементы(МассивНовыхНеВыполненныхТочек);
        МассивНовыхБудущихВыполненныхТочек   = ИА_БФКС.Массив_ПолучитьУникальныеЭлементы(МассивНовыхБудущихВыполненныхТочек);
        
        // Удалим "текущие" и добавим "новых"
        Для каждого СтрокаТЗ  Из ТабВыполняемыеДействия Цикл
            //*** Невыполненые
            ЭтоНевыполненаяПокаТочка = МассивНовыхНеВыполненныхТочек.Найти(СтрокаТЗ.Точка) <> Неопределено;
            Если ЭтоНевыполненаяПокаТочка
                И (СтрокаТЗ.Действие = Действия.ЗаписатьВыполненной
                ИЛИ СтрокаТЗ.Действие = Действия.Удалить)
                Тогда // Надо удалить
                ИА_БФКС.Массив_УдалитьЕслиЕсть(МассивНовыхНеВыполненныхТочек, СтрокаТЗ.Точка);
            ИначеЕсли СтрокаТЗ.Действие = Действия.СоздатьНевыполненной
                И МассивНовыхНеВыполненныхТочек.Найти(СтрокаТЗ.Точка) = Неопределено            
                Тогда // Новая "невыполненная" точка
                МассивНовыхНеВыполненныхТочек.Добавить(СтрокаТЗ.Точка);
                ИА_БФКС.Массив_ДобавитьЕслиНет(МассивНовыхНеВыполненныхТочек, СтрокаТЗ.Точка);
            КонецЕсли;
            //*** Выполненные
            Если СтрокаТЗ.Действие = Действия.ЗаписатьВыполненной Тогда
                ИА_БФКС.Массив_ДобавитьЕслиНет(МассивНовыхБудущихВыполненныхТочек, СтрокаТЗ.Точка);
            ИначеЕсли СтрокаТЗ.Действие = Действия.СоздатьНевыполненной Тогда
                ИА_БФКС.Массив_ДобавитьЕслиНет(МассивНовыхБудущихВыполненныхТочек, СтрокаТЗ.Точка);
                
                Потомки = ОбрБП.Точки_НайтиВсехВозможныхПотомков(СтрокаТЗ.Точка);
                Для каждого СледТочка Из Потомки Цикл
                    Если СписокТиповДляЗадач.Найти(СледТочка.Тип) <> Неопределено Тогда
                        ИА_БФКС.Массив_ДобавитьЕслиНет(МассивНовыхБудущихВыполненныхТочек, СледТочка);
                    КонецЕсли; 
                КонецЦикла; 
            ИначеЕсли СтрокаТЗ.Действие = Действия.Удалить Тогда
                ИА_БФКС.Массив_УдалитьЕслиЕсть(МассивНовыхБудущихВыполненныхТочек, СтрокаТЗ.Точка);
            КонецЕсли; 
        КонецЦикла; 
        МассивНовыхНеВыполненныхТочек = ИА_БФКС.Массив_ПолучитьУникальныеЭлементы(МассивНовыхНеВыполненныхТочек);
        МассивНовыхБудущихВыполненныхТочек   = ИА_БФКС.Массив_ПолучитьУникальныеЭлементы(МассивНовыхБудущихВыполненныхТочек);
        
        Для каждого Точка Из МассивНовыхНеВыполненныхТочек Цикл
            Потомки = ОбрБП.Точки_НайтиВсехВозможныхПотомков(Точка);
            Для каждого СледТочка Из Потомки Цикл
                Если СписокТиповДляЗадач.Найти(СледТочка.Тип) <> Неопределено Тогда
                    ИА_БФКС.Массив_ДобавитьЕслиНет(МассивНовыхБудущихВыполненныхТочек, СледТочка);
                КонецЕсли; 
            КонецЦикла; 
        КонецЦикла; 
        
        
        Для каждого Точка Из МассивНовыхНеВыполненныхТочек Цикл
            Массив = Новый Массив;
            ЗаполнитьМассивНедостающимиТочкамиДляКорректногоВыполненияВсехБудущихЗадач(ОбрБП
            , Массив
            , Точка
            , МассивНовыхБудущихВыполненныхТочек);
            //ИА_БФКС.Массив_УдалитьЕслиЕсть(Массив, Точка);
            ИА_БФКС.Массив_УдалитьПоУсловию(Массив, "Контекст.Найти(Эл) <> Неопределено", МассивНовыхБудущихВыполненныхТочек);
            ИА_БФКС.Массив_УдалитьПоУсловию(Массив, "Контекст.Найти(Эл) <> Неопределено", МассивНовыхНеВыполненныхТочек);
            Для каждого НеобходимаяТочка Из Массив Цикл            
                НовСтрока = ТабРекомендации.Добавить();
                НовСтрока.Рекомендация = "Требуется решение по точке";
                НовСтрока.Точка1 = НеобходимаяТочка;
                
                НовСтрока = ТабВыполняемыеДействия.Добавить();
                НовСтрока.Точка = НеобходимаяТочка;
                НовСтрока.Действие = Действия.ЗаписатьВыполненной;
            КонецЦикла; 
        КонецЦикла; 
        
        МассивНовыхНеВыполненныхТочек = СписокТочек;
        Для каждого Точка Из МассивНовыхНеВыполненныхТочек Цикл
            Потомки = ОбрБП.Точки_НайтиВсехВозможныхПотомков(Точка);
            Для каждого АктивнаяТочка Из МассивНовыхНеВыполненныхТочек Цикл
                Если Потомки.Найти(АктивнаяТочка) <> Неопределено Тогда
                    НовСтрока = ТабРекомендации.Добавить();
                    НовСтрока.Рекомендация = """Двойной"" поток";
                    НовСтрока.Точка1 = Точка;
                    НовСтрока.Точка2 = АктивнаяТочка;
                КонецЕсли; 
            КонецЦикла; 
        КонецЦикла;
    КонецЕсли; 
    
    ИА_БФС.ТЗ_УдалитьДубликаты(ТабВыполняемыеДействия, "Точка, Задача");
    ИА_БФС.ТЗ_УдалитьДубликаты(ТабРекомендации, "Рекомендация, Точка1, Точка2");
    Результат = Новый Структура("ТабВыполняемыеДействия, ТабРекомендации", ТабВыполняемыеДействия, ТабРекомендации); 
    Возврат Результат;
КонецФункции

Процедура ЗаполнитьМассивНедостающимиТочкамиДляКорректногоВыполненияВсехБудущихЗадач(Обр, Массив, Точка
    , МассивНовыхБудущихВыполненныхТочек, НаправлениеВверх = Ложь)
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Обр = Обработки.ИА_БПМенеджер.Создать();
    #КОНЕЦЕСЛИ
    Если НаправлениеВверх Тогда
        ТочкиСлияния = Новый Массив;
        ТочкиСлияния.Добавить(Точка);
    Иначе        
        Потомки = Обр.Точки_НайтиВсехВозможныхПотомков(Точка, Истина);
        ТочкиСлияния = ИА_БФКС.Массив_ФильтрПоУсловию(Потомки, "Эл.Тип=Контекст", Перечисления.ИА_БПТипыТочекМаршрута.Слияние);
    КонецЕсли; 
    
    Для каждого ТочкаСлияния Из ТочкиСлияния Цикл
        Инфо = Обр.Точки_ПолучитьИнформацию(ТочкаСлияния);
        
        Для каждого Родитель Из Инфо.Входящие Цикл
            ИнфоРодитель = Обр.Точки_ПолучитьИнформацию(Родитель);
            Если ИнфоРодитель.Тип = Перечисления.ИА_БПТипыТочекМаршрута.Слияние Тогда
                ЗаполнитьМассивНедостающимиТочкамиДляКорректногоВыполненияВсехБудущихЗадач(Обр, Массив, Родитель, МассивНовыхБудущихВыполненныхТочек, Истина);
            ИначеЕсли СписокТиповДляЗадач.Найти(ИнфоРодитель.Тип) <> Неопределено
                И МассивНовыхБудущихВыполненныхТочек.Найти(ИнфоРодитель) = Неопределено
                Тогда // Д.б. "выполнено"
                ИА_БФКС.Массив_ДобавитьЕслиНет(Массив, Родитель);
            КонецЕсли;
        КонецЦикла; 
    КонецЦикла;
КонецПроцедуры

Функция   БП_ПолучитьКартуМаршрутаПослеПерехода(КартаМаршрутаНовая, ТабВыполняемыеДействия) Экспорт
    Возврат ИА_Защита_НФ.БП_ПолучитьКартуМаршрутаПослеПерехода(КартаМаршрутаНовая, ТабВыполняемыеДействия, ЭтотОбъект);
КонецФункции

Процедура БП_ВыполнитьПереход(КартаМаршрутаНовая, ТабВыполняемыеДействия) Экспорт
    СписокТочекВложБП = Новый Массив;
    Для каждого Стр Из ТаблицаТочек Цикл
    	Если Стр.Тип = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс Тогда
        	СписокТочекВложБП.Добавить(Стр.Ссылка);
        КонецЕсли; 
    КонецЦикла;  
    
    ИА_Защита_НФ.БП_ВыполнитьПереход(КартаМаршрутаНовая, ТабВыполняемыеДействия, ЭтотОбъект, СписокТиповДляЗадач, СписокТочекВложБП);
КонецПроцедуры


//_____________________________________________________________
// Работа с задачами

Функция   Задачи_ПолучитьИнформацию(СписокТочек = Неопределено, ДополнятьНесуществующими = Ложь, ВключатьИсключенные = Ложь) Экспорт    
    Запрос = Новый Запрос;
    Запрос.Текст = СтрЗаменить(
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   Т.Ссылка,
    |   Т.ВерсияДанных,
    |   Т.ПометкаУдаления,
    |   Т.Номер,
    |   Т.Дата,
    |   Т.БизнесПроцесс,
    |   Т.ТочкаМаршрута,
    |   Т.Наименование,
    |   Т.Выполнена,
    |   Т.ИА_ТочкаБП,
    |   Т.ИА_ВариантУсловияБП,
    |   Т.ИА_ТочкаБП.Имя КАК ИмяТочкиБП
    |ИЗ
    |   Задача.ИА_БПЗадачаНосителя КАК Т
    |ГДЕ
    |   Т.БизнесПроцесс = &БизнесПроцесс
    |   И НЕ Т.ПометкаУдаления
    |   И Т.ИА_ТочкаБП <> ЗНАЧЕНИЕ(Справочник.ИА_БПТочкиМаршрута.ПустаяСсылка)
    |   И Т.ИА_ТочкаБП.Владелец = &КартаМаршрута
    |   И (&ВключатьИсключенные ИЛИ НЕ Т.ИА_ИсключенаИзОбработки)", "ИА_БПЗадачаНосителя", ЗадачаИмя);
    Если СписокТочек <> Неопределено Тогда
        Запрос.Текст = Запрос.Текст + " И Т.ИА_ТочкаБП В (&СписокТочек)";
        Запрос.УстановитьПараметр("СписокТочек", СписокТочек)
    КонецЕсли; 
    
    Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);    
    Запрос.УстановитьПараметр("КартаМаршрута", КартаМаршрута);
	Запрос.УстановитьПараметр("ВключатьИсключенные", ВключатьИсключенные);
    
    ТЗ = Запрос.Выполнить().Выгрузить();
    Если ДополнятьНесуществующими Тогда
        Если СписокТочек = Неопределено Тогда
            СписокТочек = ТаблицаТочек.ВыгрузитьКолонку("Ссылка");
        КонецЕсли; 
        
        Для каждого Точка Из СписокТочек Цикл
            Если ТЗ.Найти(Точка, "ИА_ТочкаБП") = Неопределено Тогда
                НовСтрока = ТЗ.Добавить();
                НовСтрока.ИА_ТочкаБП = Точка;
                НовСтрока.БизнесПроцесс = БизнесПроцесс;
                НовСтрока.Ссылка = Неопределено;
            КонецЕсли; 
        КонецЦикла; 
    КонецЕсли; 
    Возврат ТЗ;
КонецФункции

Процедура Задачи_Выполнить(мЗадача, Отказ) Экспорт
    ПереданОбъект = ИА_БФКС.РеквизитЕсть(мЗадача, "ОбменДанными");
    
    Если ПереданОбъект Тогда
        Задача = мЗадача;
    Иначе
        Задача = мЗадача.ПолучитьОбъект();
    КонецЕсли;
    
    Контекст = Новый Структура("Задача, Отказ", мЗадача, Отказ);
    ИА_БПСПереопределяемый.Задачи_ПриВыполнении(Контекст);
    Если Контекст.Отказ Тогда
    	Отказ = Истина;
        Возврат;
    КонецЕсли; 
    
    
    // Создать "следующие" задачи
    Если Задача.ИА_ТочкаБП.Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие Тогда
        Вариант = Задача.ИА_ВариантУсловияБП;
    Иначе
        Вариант = Неопределено;
    КонецЕсли; 
    
    Если Задача.ИА_ТочкаБП.ЭтоУведомление Тогда
        М = ПолучитьЗадачиНевыполненные();
        
        Если М.Количество() < 2 Тогда // Это уведомление в практически "завершенном" БП
            БП = БизнесПроцесс.ПолучитьОбъект();
            БП.Завершен = Истина;
            БП.Записать();
        КонецЕсли; 
    Иначе
        ТабЗадачТекущейТочки = Задачи_ПолучитьИнформацию(Задача.ИА_ТочкаБП);
        ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТабЗадачТекущейТочки, "СтрокаТЗ.Выполнена ИЛИ СтрокаТЗ.Ссылка=Контекст", мЗадача.Ссылка);    
        Если ТабЗадачТекущейТочки.Количество() > 0 Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Задача """ + мЗадача + """ не создаст сейчас новых задач, т.к. в точке """
            + мЗадача.ИА_ТочкаБП + """ есть невыполненные задачи (Двойной поток управления)!";
            Сообщение.Сообщить(); 
        Иначе
            Исходящие = Точки_Исходящие(Задача.ИА_ТочкаБП, Вариант);
            Для каждого СледТочка Из Исходящие Цикл
                Задачи_СоздатьПоТочке(СледТочка, мЗадача);
            КонецЦикла;
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

Функция ПолучитьСтруктуруУчетаРазделений(Уровень, ЭтоКонечнаяВетка, ВложенныйУчет = Неопределено)
	Возврат Новый Структура("Уровень, ЭтоКонечнаяВетка, ВложенныйУчет"
    , Уровень, ЭтоКонечнаяВетка, ВложенныйУчет);
КонецФункции
 
// Создает новую задачу (или ветку задач) по переданой точке маршрута
// Параметры:
// Точка - СправочникСсылка.ИА_БПТочкиМаршрута - создать задачу с этой точкой
// ИсключаяемаяЗадача - ЗадачаОбъект.<ОсновнаяЗадача> - задача-объект породившая цепочку создания
Процедура Задачи_СоздатьПоТочке(Точка, ИсключаяемаяЗадача = Неопределено, УчетРазделений = Неопределено) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    ТочкаИнфо = Точки_ПолучитьИнформацию(Точка); 
    ТипТочки = ТочкаИнфо.Тип;
    
    Если ИсключаяемаяЗадача = Неопределено Тогда
    	ИсключаяемаяЗадачаСсылка = Задачи[ЗадачаИмя].ПустаяСсылка();
    Иначе
        ИсключаяемаяЗадачаСсылка = ИсключаяемаяЗадача.Ссылка;
    КонецЕсли;
    
    Если УчетРазделений = Неопределено Тогда
    	УчетРазделений = ПолучитьСтруктуруУчетаРазделений(0, Истина);
    КонецЕсли; 
    
    Если ТипТочки = Перечисления.ИА_БПТипыТочекМаршрута.Условие И Точка.ПрограммнаяОбработка Тогда
        // Программная обработка условий
        Если НЕ ЗначениеЗаполнено(ТочкаИнфо.ЛинияДляУсловияИстинно) Тогда
            ТекстСообщения = "В точке """ + Точка + """ по """ + БизнесПроцесс + """ не выбрана линия для условия !";
            ИА_БПС.СообщениеВЖурнал("ОшибкаУсловия", ТекстСообщения);
            ВызватьИсключение ТекстСообщения;
        КонецЕсли; 
        
        Контекст = Новый Структура("БП, Точка, Задача, Результат", БизнесПроцесс, Точка, ИсключаяемаяЗадача, Неопределено);
        Обработчик = ИА_БПС.Обработчики_Получить(Точка, Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия);
        ИА_БПС.Обработчики_Выполнить(Обработчик, Контекст,,"Результат",,Истина);
        
        Если Контекст.Результат = Неопределено Тогда
            ТекстСообщения = "Обработчик в точке """ + Точка + """ по """ + БизнесПроцесс + """ не вернул варианта условия!";
            ИА_БПС.СообщениеВЖурнал("ОшибкаУсловия", ТекстСообщения);
            ВызватьИсключение ТекстСообщения;
        КонецЕсли; 
        
        Если Контекст.Результат Тогда
            Вариант = ТочкаИнфо.ЛинияДляУсловияИстинно;
        Иначе
            Вариант = ТочкаИнфо.ЛинияДляУсловияЛожно;
        КонецЕсли; 
        МассивТочек = Точки_Исходящие(Точка, Вариант);
        Для каждого СледТочка Из МассивТочек Цикл
        	Задачи_СоздатьПоТочке(СледТочка, ИсключаяемаяЗадача, УчетРазделений);
        КонецЦикла; 
    ИначеЕсли СписокТиповДляЗадач.Найти(ТипТочки) <> Неопределено и ТочкаИнфо.ЭтоУведомление Тогда    
        // Для уведомлений мы должны создать задачу, не ожидающую ничего
        Задачи_СоздатьИЗаписать(Точка); // Создадим, даже если уже есть непрочитанные (цикл и т.п.)
                                                                                        
        Массив = Точки_Исходящие(Точка); 
        Для каждого ВложеннаяТочка Из Массив Цикл
            Задачи_СоздатьПоТочке(ВложеннаяТочка, ИсключаяемаяЗадача, УчетРазделений)
        КонецЦикла; 
    ИначеЕсли СписокТиповДляЗадач.Найти(ТипТочки) <> Неопределено
        ИЛИ
        ТипТочки = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс
        Тогда    
        ЗадачиНовойТочки = Задачи_ПолучитьИнформацию(Точка);
        ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ЗадачиНовойТочки
        , "СтрокаТЗ.Выполнена ИЛИ СтрокаТЗ.Ссылка=Контекст"
        , ИсключаяемаяЗадачаСсылка);
        
        Если ЗадачиНовойТочки.Количество() > 0 Тогда
            ИА_БФКС.СообщениеОбОшибке("Задача в точке """ + Точка + """ не будет создана, т.к. в этой точке уже есть невыполненная задача (Двойной поток управления) !");
        Иначе
            Задачи_СоздатьИЗаписать(Точка); // Создать задачу // 26.11.2014 ИА_ Аврамов (1) ToDo: Для "не интерактивных условий" нет	
        КонецЕсли; 
    ИначеЕсли ТипТочки = Перечисления.ИА_БПТипыТочекМаршрута.Разделение Тогда
        Массив = Точки_Исходящие(Точка); 
        
        НовыйУчет = ПолучитьСтруктуруУчетаРазделений(УчетРазделений.Уровень + 1, Ложь, УчетРазделений);
        
        СчетчикВеток = 0;
        Для каждого ВложеннаяТочка Из Массив Цикл
            НовыйУчет.ЭтоКонечнаяВетка = СчетчикВеток = Массив.Количество() - 1;
            Задачи_СоздатьПоТочке(ВложеннаяТочка, ИсключаяемаяЗадача, НовыйУчет);
            СчетчикВеток = СчетчикВеток  + 1;
        КонецЦикла; 
        
    ИначеЕсли ТипТочки = Перечисления.ИА_БПТипыТочекМаршрута.Слияние Тогда
        //{ ИА_Аврамов 25.09.2015
        // БЫЛО:
        ////СписокТочек = Точки_ПолучитьТочкиДействияВверхПоПроцессу(Точка);
        ////ТабПредыдущихЗадач = Задачи_ПолучитьИнформацию(СписокТочек, Истина);
        ////ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТабПредыдущихЗадач
        ////, "СтрокаТЗ.Ссылка <> Неопределено И (СтрокаТЗ.Выполнена ИЛИ СтрокаТЗ.Ссылка=Контекст)"
        ////, ИсключаяемаяЗадача.Ссылка);
        //} 
        
        Если УчетРазделений.ЭтоКонечнаяВетка Тогда
            // Для варианта, когда в одной транзакции создается разветеленное дерево проверяем только конечную ветвь
            СписокТочек = Точки_ПолучитьТочкиПроверкиДляСлияния(Точка);
            ТабПредыдущихЗадач = Задачи_ПолучитьИнформацию(СписокТочек);
            ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТабПредыдущихЗадач
            , "СтрокаТЗ.Ссылка = Неопределено ИЛИ (СтрокаТЗ.Выполнена ИЛИ СтрокаТЗ.Ссылка=Контекст)"
            , ИсключаяемаяЗадача.Ссылка);
            Если ТабПредыдущихЗадач.Количество() = 0 Тогда // Всё выполнено!
                М = Точки_Исходящие(Точка);
                Для каждого СледующаяТочка Из М Цикл
                    Задачи_СоздатьПоТочке(СледующаяТочка, ИсключаяемаяЗадача, УчетРазделений.ВложенныйУчет);
                КонецЦикла; 
            КонецЕсли; 
        КонецЕсли; 
    ИначеЕсли ТипТочки = Перечисления.ИА_БПТипыТочекМаршрута.Завершение Тогда
        ТабПредыдущихЗадач = Задачи_ПолучитьИнформацию();
        Если ИсключаяемаяЗадача <> Неопределено Тогда
            ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТабПредыдущихЗадач
            , "СтрокаТЗ.Выполнена ИЛИ СтрокаТЗ.Ссылка=Контекст ИЛИ СтрокаТЗ.ИА_ТочкаБП.ЭтоУведомление"
            , ИсключаяемаяЗадача.Ссылка);    
        Иначе
            ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТабПредыдущихЗадач
            , "СтрокаТЗ.Выполнена ИЛИ СтрокаТЗ.ИА_ТочкаБП.ЭтоУведомление");    
        КонецЕсли; 
        
        Если ТабПредыдущихЗадач.Количество() = 0 Тогда
            // Можно завершать БП!
            Запрос = Новый Запрос;
            Запрос.Текст = СтрЗаменить(
            "ВЫБРАТЬ  разрешенные
            |   Т.Ссылка
            |ИЗ
            |   Задача.ИА_БПЗадачаНосителя КАК Т
            |ГДЕ
            |   Т.БизнесПроцесс = &БизнесПроцесс
            |   И Т.ИА_ТочкаБП = ЗНАЧЕНИЕ(Перечисление.ИА_БПТипыТочекМаршрута.ПустаяСсылка)
            |   И НЕ Т.Выполнена", "ИА_БПЗадачаНосителя", ЗадачаИмя);
            Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
            Результат = Запрос.Выполнить();
            Выборка = Результат.Выбрать();
            Пока Выборка.Следующий() Цикл
                Задача = Выборка.Ссылка.ПолучитьОбъект();
                Задача.Выполнена = Истина;
                Задача.Записать();
            КонецЦикла;
            
            Если ОбъектБизнесПроцесс <> Неопределено Тогда
            	БП = ОбъектБизнесПроцесс;
            Иначе
                БП = БизнесПроцесс.ПолучитьОбъект();
            КонецЕсли; 
            
            БП.Завершен = Истина;
            БП.Записать();
            
            //{ Вложенные БП
            Если ЗначениеЗаполнено(БП.ВедущаяЗадача) Тогда
            	ВедущаяЗадача = БП.ВедущаяЗадача.ПолучитьОбъект();
                ВедущаяЗадача.ДополнительныеСвойства.Вставить("ИА_ПрограммноеЗавершение", Истина);
                ВедущаяЗадача.ВыполнитьЗадачу();
            КонецЕсли; 
            //}
        КонецЕсли; 
    Иначе
        ВызватьИсключение "Пока не реализовано для типа точек """ + ТипТочки+ """ !!!";
    КонецЕсли; 
КонецПроцедуры

Функция получитьСрокзадачи(инфо)
	ТекСрок = ТекущаяДата();
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ИА_Календарь.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ИА_Календарь КАК ИА_Календарь
	               |ГДЕ
	               |	ИА_Календарь.Период > &ТекДата
	               |	И (ИА_Календарь.Рабочий = ИСТИНА
	               |			ИЛИ &БезФильтра)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.УстановитьПараметр("БезФильтра", инфо.ВариантДлительности = Перечисления.ИА_БПВариантыДней.Календарные);
	Запрос.УстановитьПараметр("ТекДата", ТекСрок);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НужноДобавить = инфо.ДлительностьВыполнения;
	Пока выборка.Следующий() и НужноДобавить>0 цикл
		ТекСрок = выборка.Период;
		НужноДобавить = НужноДобавить - 1;
	КонецЦикла;
	возврат ТекСрок;
КонецФункции

Функция   Задачи_СоздатьИЗаписать(Точка, Выполнена = Ложь) Экспорт
	#ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
	    Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
	#КОНЕЦЕСЛИ
	 
    Задача = МенеджерЗадач.СоздатьЗадачу();
    
    Точка_Инфо = Точки_ПолучитьИнформацию(Точка);
    
    Задача.Дата 			= ТекущаяДата(); 
    Задача.БизнесПроцесс 	= БизнесПроцесс;
    Задача.ИА_ТочкаБП 		= Точка;
    Задача.Наименование 	= Точка_Инфо.Наименование;
    Задача.Выполнена 		= Выполнена;
	
	Если Точка_Инфо.ДлительностьВыполнения > 0 и не Точка_Инфо.ВариантДлительности.пустая() тогда
		Задача.СрокИсполнения = получитьСрокзадачи(Точка_Инфо);
	КонецЕсли;
    
    //{ Очистим реквизиты по точке
    РеквизитыДляОчистки = ИА_БФС.ТЗ_ФильтрПоОтбору(Точка_Инфо.ВыводимыеРеквизиты
    , Новый Структура("ОчищатьПриСозданииЗадачи", Истина)).ВыгрузитьКолонку("Реквизит");
    Если РеквизитыДляОчистки.Количество() > 0 Тогда
        Если ОбъектБизнесПроцесс = Неопределено Тогда
            БПОбъект = БизнесПроцесс.ПолучитьОбъект();
        Иначе
        	БПОбъект = ОбъектБизнесПроцесс;
        КонецЕсли; 
    	
        Для каждого Стр Из БПОбъект.ИА_Реквизиты Цикл
        	Если РеквизитыДляОчистки.Найти(Стр.Реквизит) <> Неопределено Тогда
            	Стр.Значение  = Стр.Реквизит.ТипЗначения.ПривестиЗначение(Неопределено);
            КонецЕсли; 
        КонецЦикла;  
        Если ОбъектБизнесПроцесс = Неопределено Тогда
            БПОбъект.Записать();
        КонецЕсли;
    КонецЕсли; 
    //} 
	
	Задачи_ЗаполнитьАдресацию(Задача);
	
	Контекст = Новый Структура("Задача, Выполнена", Задача, Выполнена);
	ИА_БПСПереопределяемый.Задачи_ПередЗаписьюНовой(Контекст);
    
    
    Контекст = ИА_БПС.СформироватьКонтекстВыполненияДляЗадачи(Задача);
    Контекст.Вставить("Результат", Задача.Наименование);
    
    //{ Обработчики формирования наименования    
    Обработчик          = ИА_БПС.Обработчики_Получить(Точка, Перечисления.ИА_БПСобытияТочекБП.ФормированиеНаименования);
    ИА_БПС.Обработчики_Выполнить(Обработчик, Контекст,,"Результат");
    Задача.Наименование = Контекст.Результат;
    //}
    
    //{ Обработчики формирования содержания
    Если ИА_БФКС.РеквизитЕсть(Задача, "Содержание") Тогда
        Задача.Содержание   = Точка.Описание;
        Контекст.Вставить("Результат", Задача.Содержание);
        Обработчик          = ИА_БПС.Обработчики_Получить(Точка, Перечисления.ИА_БПСобытияТочекБП.ФормированиеСодержания);
        ИА_БПС.Обработчики_Выполнить(Обработчик, Контекст,,"Результат");
        Задача.Содержание   = Контекст.Результат;
    КонецЕсли; 
    //}
    
    
    
    
    
    //{ Обработка "влож. БП"
    Если Точка_Инфо.Тип = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс Тогда
        ИмяПоля = ИА_БПС.ПолучитьИмяРеквизитаАдресацииИсполнителя();
        ОтветственныйДляВложенногоБП = Задача[ИмяПоля];
        Задача[ИмяПоля] = Неопределено;
        Задача.Записать();
        
    	// Требуется запуск БП
        
        МаршрутВложБП = Точка_Инфо.МаршрутЗадачВложенногоБП;
        Если НЕ ЗначениеЗаполнено(МаршрутВложБП) Тогда
        	ВызватьИсключение ИА_БФКС.Стр_ПодставитьПараметрыВСтроку(
            "В точке ""%1"" не указан ""%2"" для запуска бизнес-процесса! БП: %3"
            ,Точка_Инфо.Ссылка, Метаданные.Справочники.ИА_БПМаршрутЗадач.ПредставлениеОбъекта, БизнесПроцесс);
        КонецЕсли; 
        
        //{ Подготовим таблицу реквизитов
        ТабРеквизитов = Точка_Инфо.РеквизитыВложенногоБП.Скопировать();
        Если ТабРеквизитов.Количество() > 0 Тогда
            КонтекстРеквизита = Неопределено;
            Для каждого Стр Из ТабРеквизитов Цикл
                Если Стр.СпособЗаполнения = Перечисления.ИА_БПСпособыЗаполненияДопРеквизитов.Перенести Тогда
                    Опции = Стр.ХранилищеДанных.Получить();
                    Если Опции = Неопределено Тогда
                        ИА_БФКС.СообщениеОбОшибке(ИА_БФКС.Стр_ПодставитьПараметрыВСтроку(
                        "Реквизит ""%1"" не заполнен, т.к. нет формулы в точке ""%2"" у БП %3"
                        ,Стр.Реквизит, Точка, БизнесПроцесс) ); 
                    Иначе
                        Если КонтекстРеквизита = Неопределено Тогда
                            КонтекстРеквизита = ИА_БПС.СформироватьКонтекстВыполненияДляЗадачи(Задача);
                        КонецЕсли; 
                        Данные = ИА_БФС.РедакторФормул_Выполнить(Опции, КонтекстРеквизита);
                        Стр.Значение = Данные.Результат;
                    КонецЕсли; 
                КонецЕсли; 
            КонецЦикла; 
        КонецЕсли; 
        //}
        БизнесПроцессы.ИА_БПНоситель.СоздатьБП(Истина, МаршрутВложБП, ТекущаяДата()
        , Задача.Ссылка, ОтветственныйДляВложенногоБП, Задача.Ссылка, ТабРеквизитов);
    Иначе
        Задача.Записать();
    КонецЕсли; 
    //}
    
    Контекст = Новый Структура("Задача, Выполнена", Задача, Выполнена);
	ИА_БПСПереопределяемый.Задачи_ПослеЗаписиНовой(Контекст);
КонецФункции

Процедура Задачи_ЗаполнитьАдресацию(Задача)
	Точка = Задача.ИА_ТочкаБП;
	#ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
	    Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
	#КОНЕЦЕСЛИ
	
	ИмяПоля = ИА_БПС.ПолучитьИмяРеквизитаАдресацииИсполнителя();
	
	Задача[ИмяПоля] = Неопределено;
	Если ЗначениеЗаполнено(Точка.Ответственный) Тогда
		Если ТипЗнч(Точка.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
			Задача[ИмяПоля] = Точка.Ответственный;
		ИначеЕсли ТипЗнч(Точка.Ответственный) = Тип("ПеречислениеСсылка.ИА_БПТипыАдресацииЗадач") Тогда
			Если Точка.Ответственный = Перечисления.ИА_БПТипыАдресацииЗадач.ОтветственныйЗаБП Тогда
				Задача[ИмяПоля]	= Задача.БизнесПроцесс.ИА_Ответственный;
			КонецЕсли; 
		КонецЕсли; 
    КонецЕсли; 
    
    Если НЕ ЗначениеЗаполнено(Задача[ИмяПоля]) Тогда
        Задача[ИмяПоля]	= Задача.БизнесПроцесс.ИА_Ответственный;
    КонецЕсли;
	
	Контекст = Новый Структура("Задача", Задача);
	ИА_БПСПереопределяемый.Задачи_ЗаполнитьАдресацию(Контекст);
    
    //{ Обработчик "УстановкаОтветственного"
    Контекст = ИА_БПС.СформироватьКонтекстВыполненияДляЗадачи(Задача);
    Контекст.Вставить("Результат", Задача[ИмяПоля]);
    Обработчик          = ИА_БПС.Обработчики_Получить(Точка, Перечисления.ИА_БПСобытияТочекБП.УстановкаОтветственного);
    ИА_БПС.Обработчики_Выполнить(Обработчик, Контекст,,"Результат");
    ЕстьОргСхема = Метаданные.Справочники.Найти("ОргСхема") <> Неопределено;
    Если ЕстьОргСхема И ТипЗнч(Контекст.Результат) = Тип("СправочникСсылка.ОргСхема") Тогда
        Задача[ИмяПоля] = Неопределено;
        Задача["Пост"]  = Контекст.Результат;
    Иначе	
        Задача[ИмяПоля] = Контекст.Результат;
    КонецЕсли; 
    //}
    
    Если ЕстьОргСхема Тогда
        Если  НЕ ЗначениеЗаполнено(Задача[ИмяПоля])
            И НЕ ЗначениеЗаполнено(Задача["Пост"])
            Тогда
        	ВызватьИсключение "Не удалось заполнить адресацию у " + Задача + ". Д.б. заполнен ""Пользователь"" или ""Пост"" !";
        КонецЕсли; 
    КонецЕсли;
    
КонецПроцедуры
 
Функция   Задачи_ПолучитьЗадачиПоИмениТочки(ИмяТочки, ВключатьИсключенные = Ложь) Экспорт
    Точка = Точки_ПолучитьПоИмениТочки(ИмяТочки);
    М = Новый Массив;
    М.Добавить(Точка);
    Результат = Задачи_ПолучитьИнформацию(М, ,ВключатьИсключенные);
    Возврат Результат;
КонецФункции

//_____________________________________________________________
// Работа с точками

Функция   Точки_ПолучитьКэш()
    Запрос = Новый Запрос;
    Запрос.Текст =
    // !!! НЕ ОТКРЫВАТЬ В КОНСТРУКТОРЕ !!!
    "ВЫБРАТЬ  разрешенные *
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   ИА_БПТочкиМаршрута.Владелец = &Владелец
    |   И НЕ ИА_БПТочкиМаршрута.ПометкаУдаления";
    Запрос.УстановитьПараметр("Владелец", КартаМаршрута);
    ТаблицаТочек = Запрос.Выполнить().Выгрузить();
    ТаблицаТочек.Колонки.Добавить("Исходящие");
    ТаблицаТочек.Колонки.Добавить("Входящие");
    Для каждого СтрокаТЗ Из ТаблицаТочек Цикл
        СтрокаТЗ.Входящие   = Справочники.ИА_БПТочкиМаршрута.ПолучитьВходящиеТочки(СтрокаТЗ.Ссылка);
        СтрокаТЗ.Исходящие  = Справочники.ИА_БПТочкиМаршрута.ПолучитьИсходящиеТочки(СтрокаТЗ.Ссылка);
    КонецЦикла; 
КонецФункции

Функция   Точки_ПолучитьПоИмениТочки(ИмяТочки) Экспорт
    М = ТаблицаТочек.НайтиСтроки(Новый Структура("Имя", ИмяТочки));
    Если М.Количество() > 0 Тогда
        Возврат М[0].Ссылка;
    Иначе
        Возврат Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    КонецЕсли; 
КонецФункции

Функция   Точки_ПолучитьИнформацию(Точка) Экспорт
    М = ТаблицаТочек.НайтиСтроки(Новый Структура("Ссылка", Точка));
    Если М.Количество() > 0 Тогда
        Возврат М[0];
    Иначе
        ТЗ = ТаблицаТочек.СкопироватьКолонки();
        Возврат ТЗ.Добавить();
    КонецЕсли; 
КонецФункции

Функция   Точки_Тип(Точка)
    Инфо = Точки_ПолучитьИнформацию(Точка);
    Возврат Инфо.Тип;
КонецФункции

Функция   Точки_Входящие(Точка)
    Инфо = Точки_ПолучитьИнформацию(Точка);
    Возврат Инфо.Входящие;
КонецФункции

Функция   Точки_Исходящие(Точка, Вариант = Неопределено)
    Инфо = Точки_ПолучитьИнформацию(Точка);
    Если Вариант = Неопределено Тогда
        Результат = Инфо.Исходящие;
    Иначе
        Таб = ИА_БФС.ТЗ_ФильтрПоУсловию(Инфо.ИсходящиеЛинии, "СтрокаТЗ.Вариант = Контекст" , Вариант);
        Результат = Таб.ВыгрузитьКолонку("Адрес");
    КонецЕсли;     
    Возврат Результат;
КонецФункции

Функция   Точки_ПолучитьТочкиДействияВверхПоПроцессу(Точка)
    Массив = Новый Массив;
    М = Точки_Входящие(Точка);		
    Для каждого ПредТочка Из М Цикл
        Тип = Точки_Тип(ПредТочка);
        Если Тип = Перечисления.ИА_БПТипыТочекМаршрута.Действие
            ИЛИ Тип = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс
            Тогда
            Массив.Добавить(ПредТочка);	
        ИначеЕсли Тип = Перечисления.ИА_БПТипыТочекМаршрута.Старт Тогда
            // Ничего!
        ИначеЕсли Тип = Перечисления.ИА_БПТипыТочекМаршрута.Слияние Тогда
            М2 = Точки_ПолучитьТочкиДействияВверхПоПроцессу(ПредТочка);
            Для каждого Эл Из М2 Цикл
                Массив.Добавить(Эл);
            КонецЦикла; 
        ИначеЕсли Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие Тогда            
            // ИА_ 24.03.2015  условия должны также обрабатываться
            Если ПредТочка.ПрограммнаяОбработка Тогда
                М2 = Точки_ПолучитьТочкиДействияВверхПоПроцессу(ПредТочка);
                Для каждого Эл Из М2 Цикл
                    Массив.Добавить(Эл);
                КонецЦикла; 
            Иначе
                Массив.Добавить(ПредТочка);
            КонецЕсли; 
        ИначеЕсли Тип = Перечисления.ИА_БПТипыТочекМаршрута.Разделение Тогда            
            // ИА_Аврамов 24.03.2015  
            М2 = Точки_ПолучитьТочкиДействияВверхПоПроцессу(ПредТочка);
            Для каждого Эл Из М2 Цикл
                Массив.Добавить(Эл);
            КонецЦикла; 
        Иначе
            ВызватьИсключение "Не реализован поиск для типа " + Тип + " !";
        КонецЕсли;        
    КонецЦикла; 
    Возврат Массив;
КонецФункции

Функция   Точки_НайтиВсехВозможныхПотомков(Точка, ВсеТипы = Ложь) Экспорт
    Результат = Новый Массив;
    
    Точки_НайтиВсехВозможныхПотомковИтератор(Точка, Результат, ВсеТипы);	
    
    ИндексИсходной = Результат.Найти(Точка);
    Если ИндексИсходной <> Неопределено Тогда
        Результат.Удалить(ИндексИсходной);	
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

Процедура Точки_НайтиВсехВозможныхПотомковИтератор(Точка, МассивРезультат, ВсеТипы)
    
    Инфо = Точки_ПолучитьИнформацию(Точка);
    Если  (ВсеТипы ИЛИ СписокТиповДляЗадач.Найти(Инфо.Тип) <> Неопределено)
        И МассивРезультат.Найти(Точка) = Неопределено
        Тогда
        МассивРезультат.Добавить(Точка);
    ИначеЕсли МассивРезультат.Найти(Точка) <> Неопределено Тогда
        Возврат
    КонецЕсли; 
    
    Для каждого СледТочка Из Инфо.Исходящие Цикл
        Точки_НайтиВсехВозможныхПотомковИтератор(СледТочка, МассивРезультат, ВсеТипы);
    КонецЦикла; 
КонецПроцедуры

Функция   Точки_НайтиВсехВозможныхПредков(Точка, ВсеТипы = Ложь) Экспорт
    Результат = Новый Массив;
    
    Точки_НайтиВсехВозможныхПредковИтератор(Точка, Результат, ВсеТипы);	
    
    ИндексИсходной = Результат.Найти(Точка);
    Если ИндексИсходной <> Неопределено Тогда
        Результат.Удалить(ИндексИсходной);	
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

Процедура Точки_НайтиВсехВозможныхПредковИтератор(Точка, МассивРезультат, ВсеТипы)
    Инфо = Точки_ПолучитьИнформацию(Точка);
    Если  (ВсеТипы ИЛИ СписокТиповДляЗадач.Найти(Инфо.Тип) <> Неопределено)
        И МассивРезультат.Найти(Точка) = Неопределено
        Тогда
        МассивРезультат.Добавить(Точка);
    ИначеЕсли МассивРезультат.Найти(Точка) <> Неопределено Тогда
        Возврат
    КонецЕсли;
    
    Для каждого Родитель Из Инфо.Входящие Цикл
        Точки_НайтиВсехВозможныхПредковИтератор(Родитель, МассивРезультат, ВсеТипы);
    КонецЦикла; 
КонецПроцедуры

Функция   Точки_ТипыДляЗадач() Экспорт
    Возврат ИА_БФС.КопияОбъекта(СписокТиповДляЗадач);
КонецФункции
 
Функция   Точки_ПолучитьТочкиПроверкиДляСлияния(Точка, СчетчикСлияний = 0, МассивТочекДляВозврата = Неопределено)
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    Если МассивТочекДляВозврата = Неопределено Тогда
    	МассивТочекДляВозврата = новый Массив;
    КонецЕсли; 
    
    менТ = Перечисления.ИА_БПТипыТочекМаршрута;
    
    ТочкаИнфо = Точки_ПолучитьИнформацию(Точка);
    МассивВходящихТочек = Точки_Входящие(Точка);
    
    Для каждого ВходящаяТочка Из МассивВходящихТочек Цикл
        ВходящаяТочкаИнфо = Точки_ПолучитьИнформацию(ВходящаяТочка);
        ТипВхТ = ВходящаяТочкаИнфо.Тип;
        
        Если ТипВхТ = менТ.Разделение И СчетчикСлияний = 0 Тогда
        	// Выход из главного блока
            Возврат МассивТочекДляВозврата;
        КонецЕсли; 
        
        Если ТипВхТ = Перечисления.ИА_БПТипыТочекМаршрута.Слияние Тогда
        	СчетчикСлияний = СчетчикСлияний + 1;
        ИначеЕсли ТипВхТ = Перечисления.ИА_БПТипыТочекМаршрута.Разделение Тогда
        	СчетчикСлияний = СчетчикСлияний - 1;
        КонецЕсли; 
        
        Если МассивТочекДляВозврата.Найти(ВходящаяТочка) = Неопределено
            И ( (ТипВхТ = менТ.Действие И НЕ ВходящаяТочкаИнфо.ЭтоУведомление)
            ИЛИ  ТипВхТ = менТ.ВложенныйБизнесПроцесс
            ИЛИ (ТипВхТ = менТ.Условие  И НЕ ВходящаяТочкаИнфо.ПрограммнаяОбработка)
            )
            Тогда
        	МассивТочекДляВозврата.Добавить(ВходящаяТочка);
        КонецЕсли; 
        
        Точки_ПолучитьТочкиПроверкиДляСлияния(ВходящаяТочка, СчетчикСлияний, МассивТочекДляВозврата);
    КонецЦикла; 
    
    Возврат МассивТочекДляВозврата;
КонецФункции
